{
  "backend/main.mo": "Defines data types and storage maps for quizzes, games, puzzles, sounds, and coloring templates, including localization utilities and converters.",
  "feature_evidence.json": "Describes a feature request for creating a full Spanish translation pack and lists related files, components, and tests.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for multiple frontend files describing their purpose and functionality.",
  "frontend/index.css": "Defines global Tailwind-based styles and CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the main frontend script.",
  "frontend/src/App.tsx": "Main React component managing routing, age selection, global providers, and page rendering.",
  "frontend/src/components/CelebrationModal.tsx": "Displays a celebration modal with confetti, messages, and action buttons after completing quizzes or games.",
  "frontend/src/components/coloring/ColoringCanvas.tsx": "Canvas-based coloring tool with brush, zoom, undo, clear, and touch gesture support, loading either backend or fallback template images.",
  "frontend/src/components/Footer.tsx": "Renders a decorative footer with animated star and sparkle icons.",
  "frontend/src/components/games/LogicPuzzleGame.tsx": "Generates and runs logic puzzles by age group, tracking score, puzzle types, localization, and level progression.",
  "frontend/src/components/games/MathPuzzleGame.tsx": "Creates age-appropriate math problems with multiple-choice options, scoring, and progression tracking.",
  "frontend/src/components/games/MemoryCardGame.tsx": "Memory matching game using emoji themes, managing card states, scoring, and completion flow.",
  "frontend/src/components/games/ProblemSolvingGame.tsx": "Presents scenario-based problem‑solving questions by age group with localized text, scoring, and category selection.",
  "frontend/src/components/games/QuickReactionTapGame.tsx": "Implements a timed tap-reaction game that generates random emoji targets per round and tracks score across age‑adjusted difficulty settings.",
  "frontend/src/components/games/ShapeMatchingGame.tsx": "Provides a memory-style shape‑matching game with age‑based shape sets, tracking selections, matches, and completion.",
  "frontend/src/components/games/SortingClassificationGame.tsx": "Renders a sorting game where items must be placed into age‑appropriate categories, updating progress as items are sorted.",
  "frontend/src/components/games/VisualRecognitionGame.tsx": "Creates a spot‑the‑difference game with random difference locations and multiple scene types, completing when all differences are found.",
  "frontend/src/components/Header.tsx": "Header with branding, language selector, and optional home navigation button.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown allowing users to switch among ten supported UI languages.",
  "frontend/src/contexts/LanguageContext.tsx": "Supplies a global language context with persistence and mapping to backend language codes.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useImageCache.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, identity storage, and related context access.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks for fetching games, quiz questions, encouragement messages, and other game types, mapping frontend age groups to backend formats.",
  "frontend/src/hooks/useRandomizedQuizQuestions.ts": "Defines a React Query hook that fetches randomized quiz questions from the backend based on age group, language, and requested count.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and defines a colorful children‑friendly theme along with custom animations.",
  "frontend/src/lib/coloringFallbackTemplates.ts": "Contains structured fallback coloring template metadata for each age group, ensuring strict outline‑only rules for offline use.",
  "frontend/src/lib/dailySurprise.ts": "Implements deterministic daily game selection per age group using localStorage and a seeded random method.",
  "frontend/src/lib/fallbackQuizQuestions.ts": "Stores multilingual static fallback quiz questions organized by age group for use when backend data is unavailable.",
  "frontend/src/lib/imageCache.ts": "Empty placeholder file for image caching logic.",
  "frontend/src/lib/quizQuestionSelection.ts": "Provides utilities for shuffling, selecting quiz subsets, and managing repeat‑reduction via localStorage‑tracked quiz history.",
  "frontend/src/lib/translations.ts": "Defines supported language codes and a large dictionary of common UI translation strings.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ColoringZone.tsx": "Displays a coloring template gallery with backend or fallback templates and renders a coloring canvas when a template is selected.",
  "frontend/src/pages/GameZone.tsx": "Loads available games for the selected age group and renders the chosen game with completion celebration handling.",
  "frontend/src/pages/HomePage.tsx": "Shows the welcome screen, mascot, and age selection, then allows navigation to games, quizzes, or coloring.",
  "frontend/src/pages/QuizZone.tsx": "Runs a quiz session using backend or fallback questions with progress, scoring, and celebration flow.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, animations, and plugin usage.",
  "project_state.json": "Tracks project state for building a full Spanish UI translation pack, including existing features, new requests, issues, and architectural notes about the i18n system."
}