{
  "backend/main.mo": "Motoko canister defining data models for multilingual educational games (quizzes, games, puzzles, sounds, coloring templates) with age groups and languages, plus in-memory Maps and helper functions to localize and convert content.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence fixes to ColoringCanvas touch gesture and pinch-zoom behavior, listing affected files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend React files, pages, components, hooks, styles, and configurations describing app structure, features, and multilingual, age-based support.",
  "frontend/index.css": "Global Tailwind CSS base defining OKLCH color tokens, light/dark theme variables, and base styles optimized for a child-friendly UI.",
  "frontend/index.html": "Root HTML template setting up metadata and mounting the React app at the #root element.",
  "frontend/src/App.tsx": "Main React application component managing page navigation, age group selection, and global providers (React Query, theme, language) with header, footer, and routed zones.",
  "frontend/src/components/CelebrationModal.tsx": "Modal component showing confetti animations, encouragement messages, and quiz results using language-aware text and backend-fetched messages.",
  "frontend/src/components/coloring/ColoringCanvas.tsx": "Implements an interactive coloring canvas using HTML5 canvas with brush, color palette, undo history, clear, zoom, pinch, pan, and double-tap gestures. Loads coloring templates from backend or fallback images and supports mobile-friendly drawing controls with localization and UI actions.",
  "frontend/src/components/Footer.tsx": "Decorative footer with animated star and sparkle icons for visual polish, without navigation or text content.",
  "frontend/src/components/games/LogicPuzzleGame.tsx": "Provides a logic puzzle game that generates or fetches age-based puzzles (numbers, patterns, words, spatial, time) with scoring and progression. Handles user input, answer checking, localization, and level completion callbacks.",
  "frontend/src/components/games/MathPuzzleGame.tsx": "Implements an age-based math quiz game that dynamically generates arithmetic problems with multiple-choice answers. Tracks score and progress, shows feedback, and notifies completion after a fixed number of questions with localization support.",
  "frontend/src/components/games/MemoryCardGame.tsx": "Implements a memory matching card game with many emoji-based themes selected by age group. Manages card flipping, matching logic, scoring, progression, backend integration, and localized UI feedback.",
  "frontend/src/components/games/ProblemSolvingGame.tsx": "Implements a scenario-based problem-solving game with multiple-choice answers across categories like everyday life, social, and teamwork. Uses age-specific tasks (local or backend), tracks progress and score, and supports localization and completion callbacks.",
  "frontend/src/components/games/ShapeMatchingGame.tsx": "Implements a shape matching memory game that varies difficulty by age group, shuffling colored shapes and tracking selections, matches, and moves. Uses language context and translations for feedback and calls callbacks on completion or back navigation.",
  "frontend/src/components/games/VisualRecognitionGame.tsx": "Implements a visual recognition \"find the differences\" game with randomized difference points and age-based difficulty. Handles scene selection, click detection, success/error feedback, and completion callbacks with localized messages.",
  "frontend/src/components/Header.tsx": "Top application header displaying branding, language selector, and an optional back-to-home button with multilingual labels.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown language switcher allowing users to select among 10 supported languages with flags, updating global language state.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for managing the current UI language, persisting it to localStorage, and mapping frontend language codes to backend language enums. Exposes hooks to read and update language across the app.",
  "frontend/src/hooks/useActor.ts": "Defines a hook that creates and caches a backend actor using React Query, switching between anonymous and authenticated identities. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useImageCache.ts": "This file is currently empty and does not define any hooks or logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider, managing login, logout, identity persistence, and status flags. Wraps DFINITY AuthClient setup and exposes hooks for accessing identity and auth state.",
  "frontend/src/hooks/useQueries.ts": "Contains multiple React Query hooks for fetching games, quizzes, puzzles, and messages from the backend based on age group and language. Handles mapping between frontend age groups and backend enums and includes basic error handling and caching.",
  "frontend/src/index.css": "Defines global Tailwind CSS setup with a child-friendly color palette, theme variables, and typography. Adds custom animations and utility classes for playful UI effects like bouncing and confetti.",
  "frontend/src/lib/coloringFallbackTemplates.ts": "Defines fallback coloring templates grouped by age range, including metadata and local image URLs, to be used when backend templates are unavailable.",
  "frontend/src/lib/imageCache.ts": "File is currently empty and contains no implementation or exports.",
  "frontend/src/lib/translations.ts": "Declares supported language codes and a large dictionary of common UI translation strings used throughout the app.",
  "frontend/src/main.tsx": "Bootstraps the React app by creating the root, configuring React Query, wrapping providers, and rendering the main App component.",
  "frontend/src/pages/ColoringZone.tsx": "Implements the coloring section UI, fetching templates by age group, falling back to local templates, and rendering a coloring canvas when a template is selected.",
  "frontend/src/pages/GameZone.tsx": "Handles game selection and gameplay flow by age group, loading games from queries and rendering specific game components with completion celebrations.",
  "frontend/src/pages/HomePage.tsx": "Renders the home screen with welcome content, age group selection, and navigation to games, quiz, or coloring sections using localized text.",
  "frontend/src/pages/QuizZone.tsx": "Implements the Quiz Zone page that fetches age-group-specific quiz questions via React Query with a rich multilingual fallback dataset, manages quiz state (progress, answers, score), and shows results with feedback, toasts, and a celebration modal.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, content paths, custom container settings, extended color palette (including fun-themed OKLCH colors), animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the overall project state and architecture of the LearnFun app, including schema/version info, a high-level summary, and a structured list of implemented features such as navigation, i18n, authentication, data fetching, and UI layout."
}