{
  "backend/main.mo": "Motoko backend defining data types for games, quizzes, puzzles, sounds, and templates, with localization utilities and in-memory maps for storing all content.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including pages, components, hooks, and contexts.",
  "frontend/index.css": "Global Tailwind base and theme variables defining light and dark mode color tokens for the UI.",
  "frontend/index.html": "HTML entry point configuring early Android audio bridge detection and registering the service worker.",
  "frontend/public/sw.js": "Service worker implementing precaching, offline navigation fallback, and stale‑while‑revalidate asset caching.",
  "frontend/README.md": "Frontend overview documenting features, offline support, and the Android audio bridge system.",
  "frontend/src/App.tsx": "Main React app component controlling page navigation, age selection, providers, and background music handling.",
  "frontend/src/components/BackgroundMusicSelectorModal.tsx": "Modal allowing users to choose background music via radio options and update selection in context.",
  "frontend/src/components/CelebrationModal.tsx": "Celebration popup with confetti, sound, and localized messages shown after completing a level or quiz.",
  "frontend/src/components/coloring/ColoringCanvas.tsx": "Interactive coloring canvas supporting drawing, undo, zoom, pinch gestures, and template loading.",
  "frontend/src/components/Footer.tsx": "Simple animated footer displaying colorful star and sparkle icons.",
  "frontend/src/components/games/LogicPuzzleGame.tsx": "Logic puzzle game that generates age-based puzzles, tracks progress, and handles user answers.",
  "frontend/src/components/games/MathPuzzleGame.tsx": "Generates age‑adaptive math problems with multiple choice answers and tracks score and progress across a fixed number of questions.",
  "frontend/src/components/games/MemoryCardGame.tsx": "Implements a memory matching game using various emoji themes, handling flipping, matching logic, and completion callbacks.",
  "frontend/src/components/games/ProblemSolvingGame.tsx": "Presents age‑appropriate situational problems with multiple options, selects randomized scenarios, and tracks solved count and scoring.",
  "frontend/src/components/games/QuickReactionTapGame.tsx": "Runs a timed reaction game where players tap a correct emoji target among distractors, adjusting difficulty by age group.",
  "frontend/src/components/games/ShapeMatchingGame.tsx": "Generates shape pairs based on matching rules and level config, handling selection, matching, and progression.",
  "frontend/src/components/games/SortingClassificationGame.tsx": "Implements a sorting game where users assign items to categories, tracking selections, validation, remaining items and completion flow.",
  "frontend/src/components/games/VisualRecognitionGame.tsx": "Provides a visual recognition game that generates random difference points on themed scenes and checks user clicks until all differences are found.",
  "frontend/src/components/Header.tsx": "Header with app title, language selector, audio controls, music selector, and a home button.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown menu for choosing the app’s language with flags and names.",
  "frontend/src/config/audioConfig.ts": "Defines Android-only audio mode detection using runtime flags or environment variables and exposes a helper to check the mode.",
  "frontend/src/contexts/AudioSettingsContext.tsx": "Context for persisting and toggling background music and sound effects mute settings, synced with the audio service.",
  "frontend/src/contexts/BackgroundMusicContext.tsx": "Context managing the selected background music track with localStorage persistence.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides app-wide language state with validation, persistence, and mapping to backend language enums.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useAppBackgroundMusic.ts": "Manages background audio playback across navigation with Android bridge detection, autoplay gating, and track switching logic.",
  "frontend/src/hooks/useBackgroundAudio.ts": "Starts background audio only after user interaction and prevents duplicate restarts, with cleanup on unmount.",
  "frontend/src/hooks/useImageCache.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication using AuthClient, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks to fetch games, quiz questions, encouragement messages, and other content from the backend, mapping frontend age groups to backend formats.",
  "frontend/src/hooks/useRandomizedQuizQuestions.ts": "React Query hook fetching randomized quiz questions from the backend based on age group, language, and count.",
  "frontend/src/index.css": "Tailwind-based global styles defining a colorful theme, base styling, font, and custom animations.",
  "frontend/src/lib/backgroundMusicOptions.ts": "Exports a list of selectable background music options with IDs and labels.",
  "frontend/src/lib/coloringFallbackTemplates.ts": "Provides structured fallback coloring templates per age group with strict outline-only image rules.",
  "frontend/src/lib/dailySurprise.ts": "Generates or retrieves a deterministic daily surprise game per age group, storing results in localStorage.",
  "frontend/src/lib/fallbackQuizQuestions.ts": "Contains extensive fallback quiz questions in Turkish and English organized by age group.",
  "frontend/src/lib/imageCache.ts": "Empty file with no implementation.",
  "frontend/src/lib/quizQuestionSelection.ts": "Utilities for randomized quiz question selection with history-based repeat reduction and localStorage tracking.",
  "frontend/src/lib/shapeMatchingRoundConfig.ts": "Generates shape‑matching round settings based on age group and level, defining pair counts and rule/shape options.",
  "frontend/src/lib/shapeMatchingRules.ts": "Defines shape‑matching rule types, evaluation logic, and utilities for retrieving rules allowed per age group.",
  "frontend/src/lib/sortingClassificationItemPools.ts": "Provides category lists and expanded item pools per age group for the sorting/classification game.",
  "frontend/src/lib/sortingClassificationSelection.ts": "Selects session items for sorting/classification with repetition avoidance, validation, and localStorage history.",
  "frontend/src/lib/sounds.ts": "Declares sound ID lists and functions to validate SFX and background sound identifiers.",
  "frontend/src/lib/translations.ts": "Contains shared translation strings and language codes for the app's UI text.",
  "frontend/src/main.tsx": "React entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/ColoringZone.tsx": "Displays a list of coloring templates from backend or fallback and loads a coloring canvas when a template is selected.",
  "frontend/src/pages/GameZone.tsx": "Fetches available games, manages game selection and completion flow, and renders the chosen game with celebration handling.",
  "frontend/src/pages/HomePage.tsx": "Shows the welcome screen, handles age-group selection, and navigates to games, quiz, or coloring sections.",
  "frontend/src/pages/QuizZone.tsx": "Loads quiz questions from backend or fallback, runs the quiz flow with scoring and progress tracking, and shows a celebration on completion.",
  "frontend/src/services/audio.ts": "Provides Android-specific and web fallback audio playback for sound effects and background music with mute controls and validation.",
  "frontend/src/types/androidBridge.d.ts": "Defines TypeScript interfaces for Android WebView audio bridges handling background music and sound effects independently.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, known audio mute issues, existing feature entries, and a pending new feature request."
}