{
  "backend/main.mo": "Motoko backend defining localized game, quiz, puzzle, sound, and coloring data types with storage maps and helpers for language-specific text conversion.",
  "feature_evidence.json": "Feature evidence file listing translation-related requirements for French and German UI dictionaries and associated metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend source files describing their roles and features.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables, dark mode overrides, and global styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component managing navigation, age selection, and global providers for queries, theming, and language.",
  "frontend/src/components/CelebrationModal.tsx": "Celebration modal displaying confetti, messages, and retry/continue actions after completing games or quizzes.",
  "frontend/src/components/coloring/ColoringCanvas.tsx": "Interactive coloring canvas with brush, zoom, undo history, and image template loading logic.",
  "frontend/src/components/Footer.tsx": "Footer with decorative animated star and sparkle icons.",
  "frontend/src/components/games/LogicPuzzleGame.tsx": "Generates and manages logic puzzles by age group, tracks progress, and handles localized puzzle content.",
  "frontend/src/components/games/MathPuzzleGame.tsx": "Creates age‑appropriate math problems with multiple‑choice answers and tracks scoring through a short quiz.",
  "frontend/src/components/games/MemoryCardGame.tsx": "Memory matching game using themed emoji card sets, managing flips, matches, and completion state.",
  "frontend/src/components/games/ProblemSolvingGame.tsx": "Presents scenario‑based problem‑solving questions by age group and category, tracking score and progression.",
  "frontend/src/components/games/QuickReactionTapGame.tsx": "Implements a timed tap-reaction game that generates random targets per round and tracks score until all rounds finish.",
  "frontend/src/components/games/ShapeMatchingGame.tsx": "Provides a shape‑matching memory game with difficulty varying by age group and tracks matched pairs and moves.",
  "frontend/src/components/games/SortingClassificationGame.tsx": "Implements a drag‑and‑sort style classification game where items are sorted into age‑appropriate categories.",
  "frontend/src/components/games/VisualRecognitionGame.tsx": "Runs a find‑the‑difference visual game with randomly placed differences and scene switching based on age group.",
  "frontend/src/components/Header.tsx": "Header showing branding, language selector, and optional back-to-home button.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown language selector allowing users to switch among ten supported languages with flags.",
  "frontend/src/contexts/LanguageContext.tsx": "Manages global language state with persistence and maps UI languages to backend enum values.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useImageCache.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks for fetching games, questions, and messages from the backend based on age group and language mappings.",
  "frontend/src/hooks/useRandomizedQuizQuestions.ts": "Defines a hook that fetches randomized quiz questions from the backend using age group, language, and count.",
  "frontend/src/index.css": "Sets global Tailwind-based styles with a colorful children-friendly theme and custom animations.",
  "frontend/src/lib/coloringFallbackTemplates.ts": "Contains structured fallback coloring template metadata for each age group with strict outline-only image requirements.",
  "frontend/src/lib/dailySurprise.ts": "Implements deterministic daily surprise game selection per age group with localStorage caching.",
  "frontend/src/lib/fallbackQuizQuestions.ts": "Provides large multilingual fallback quiz question pools organized by age group.",
  "frontend/src/lib/imageCache.ts": "Empty file reserved for future image caching logic.",
  "frontend/src/lib/quizQuestionSelection.ts": "Offers utilities for shuffling, selecting quiz subsets, and managing repeat-reduction via localStorage history.",
  "frontend/src/lib/translations.ts": "Defines supported language codes and a large dictionary of common UI translation strings used throughout the app.",
  "frontend/src/main.tsx": "Bootstraps the React application with React Query and Internet Identity providers.",
  "frontend/src/pages/ColoringZone.tsx": "Renders the coloring zone, loading templates from backend or fallbacks and displaying a canvas for coloring.",
  "frontend/src/pages/GameZone.tsx": "Loads available games, lets users pick one, and renders the selected game with celebration handling on completion.",
  "frontend/src/pages/HomePage.tsx": "Displays the welcome screen, mascot, and age selection UI, then navigates to games, quiz, or coloring sections.",
  "frontend/src/pages/QuizZone.tsx": "Runs the quiz flow using backend or fallback questions with history-aware selection, showing progress and results.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, containers, and plugins for the app's design system.",
  "project_state.json": "Defines the localization project state, including existing French and German translation feature tasks and a pending request to add full translation files. Contains metadata, notes, and versioning for project tracking."
}