{
  "backend/main.mo": "Defines backend actor with localized types for quizzes, games, puzzles, sounds, and coloring templates, plus helper functions for language conversion.",
  "feature_evidence.json": "Feature evidence report describing missing translation‑key coverage and listing affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files including pages, components, hooks, contexts, and translations.",
  "frontend/index.css": "Tailwind CSS base definitions with extensive OKLCH color variables for light and dark themes.",
  "frontend/index.html": "App HTML entrypoint with Android audio bridge detection, service worker registration, and script bootstrapping.",
  "frontend/public/sw.js": "Service worker implementing app‑shell caching, stale‑while‑revalidate for assets, and offline navigation fallback.",
  "frontend/README.md": "Project README describing features, offline support, and Android audio bridge requirements.",
  "frontend/src/App.tsx": "Main React app wrapper managing navigation, age selection, providers, and background music control.",
  "frontend/src/components/BackgroundMusicSelectorModal.tsx": "Empty component file placeholder for a background‑music selection modal.",
  "frontend/src/components/CelebrationModal.tsx": "Displays a celebration modal with confetti, sounds, and congratulatory messages for level or quiz completion.",
  "frontend/src/components/coloring/ColoringCanvas.tsx": "Implements a coloring canvas with brush tools, undo history, zoom, gestures, and template loading.",
  "frontend/src/components/Footer.tsx": "Renders a decorative footer with animated icons and a privacy policy link.",
  "frontend/src/components/games/LogicPuzzleGame.tsx": "Runs a logic puzzle game with generated or backend puzzles, user input, scoring, and progression.",
  "frontend/src/components/games/MathPuzzleGame.tsx": "Math quiz game that generates age‑appropriate arithmetic problems and tracks score over a fixed number of questions.",
  "frontend/src/components/games/MemoryCardGame.tsx": "Emoji‑based memory matching game using many possible themes, managing card flipping, matching, and completion.",
  "frontend/src/components/games/ProblemSolvingGame.tsx": "Multiple‑choice problem‑solving scenarios pulled from backend or fallbacks, tracking score across a set number of situations.",
  "frontend/src/components/games/QuickReactionTapGame.tsx": "Fast‑paced reaction game where players tap the correct target within time limits across escalating rounds.",
  "frontend/src/components/games/ShapeMatchingGame.tsx": "Shape‑matching puzzle that generates rule‑based shape pairs, shuffles them, tracks matches, and progresses levels.",
  "frontend/src/components/games/SortingClassificationGame.tsx": "Implements a drag-and-sort style game where children assign items to categories, tracking progress and completion based on remaining items.",
  "frontend/src/components/games/VisualRecognitionGame.tsx": "Provides a find-the-differences game that generates random difference points, handles clicks, tracks found items, and completes when all differences are found.",
  "frontend/src/components/Header.tsx": "Shows the app header with mascot, title, language selector, music controls, and home button.",
  "frontend/src/components/LanguageSelector.tsx": "Provides a dropdown to switch the app’s language using flags and language names.",
  "frontend/src/components/MusicControlsPopup.tsx": "Offers a popover to control background music, sound effects, and select music tracks.",
  "frontend/src/config/audioConfig.ts": "Defines detection logic for enabling Android-only audio mode using WebView bridge APIs and disables all web audio fallbacks.",
  "frontend/src/contexts/AudioSettingsContext.tsx": "Manages global mute settings for background music and sound effects with persistence in localStorage.",
  "frontend/src/contexts/BackgroundMusicContext.tsx": "Stores and persists the selected background music track and exposes setters through React context.",
  "frontend/src/contexts/LanguageContext.tsx": "Handles global language selection, persistence, and mapping to backend language enums.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refetches dependent queries when the identity changes.",
  "frontend/src/hooks/useAppBackgroundMusic.ts": "Controls background music playback with Android bridge detection, user-interaction gating, and prevention of redundant restarts.",
  "frontend/src/hooks/useBackgroundAudio.ts": "Starts background audio only after user interaction and avoids restarting the same track unnecessarily.",
  "frontend/src/hooks/useImageCache.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication state using AuthClient, including loading, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks to fetch games, quiz questions, encouragement messages, and other content from the backend based on age group and language.",
  "frontend/src/hooks/useRandomizedQuizQuestions.ts": "Fetches a randomized set of quiz questions from the backend using React Query, keyed by age group, language, and count.",
  "frontend/src/index.css": "Tailwind CSS setup with custom variables, a child-friendly color palette, font settings, and utility animations.",
  "frontend/src/lib/backgroundMusicOptions.ts": "Exports a list of background music option IDs with translation label keys for UI selection.",
  "frontend/src/lib/coloringFallbackTemplates.ts": "Defines offline fallback coloring templates per age group, each referencing outline-only images suitable for children.",
  "frontend/src/lib/dailySurprise.ts": "Implements deterministic daily surprise game selection per age group using seeded randomness and localStorage persistence.",
  "frontend/src/lib/fallbackQuizQuestions.ts": "Contains extensive fallback quiz question pools in Turkish and English organized by age group.",
  "frontend/src/lib/imageCache.ts": "Empty file placeholder for image caching logic.",
  "frontend/src/lib/localizedText.ts": "Provides a helper to resolve a backend LocalizedText object into a string for a given UI language with English fallback.",
  "frontend/src/lib/logicPuzzleFallback.ts": "Provides fallback time-based puzzles in Turkish and English, selecting difficulty and content by age group.",
  "frontend/src/lib/problemSolvingFallback.ts": "Defines fallback problem-solving scenarios with options and correct answers, organized by age group and category.",
  "frontend/src/lib/quizQuestionSelection.ts": "Implements quiz question selection with shuffling, history tracking, and repeat reduction using localStorage.",
  "frontend/src/lib/shapeMatchingRoundConfig.ts": "Generates shape‑matching round settings based on age group and level, adjusting pair counts, shape types, and rules.",
  "frontend/src/lib/shapeMatchingRules.ts": "Declares matching rules with evaluation logic and age requirements, and filters applicable rules by age group.",
  "frontend/src/lib/sortingClassificationItemPools.ts": "Contains sorting/classification item pools and categories per age group for a categorization game.",
  "frontend/src/lib/sortingClassificationSelection.ts": "Provides item selection for the sorting/classification game with shuffling, repetition avoidance, validation, and localStorage history.",
  "frontend/src/lib/sounds.ts": "Defines canonical sound IDs and type guards for sound validation.",
  "frontend/src/lib/translations.ts": "Exports language codes and a large dictionary of UI translations for the app.",
  "frontend/src/main.tsx": "Initializes React app root with query client and Internet Identity provider.",
  "frontend/src/pages/ColoringZone.tsx": "Displays coloring templates, handles loading, fallback templates, image errors, and renders the coloring canvas.",
  "frontend/src/pages/GameZone.tsx": "Loads available games, manages game selection and completion, and displays celebration UI.",
  "frontend/src/pages/HomePage.tsx": "Shows welcome screen, mascot, age selection, and navigation to games, quiz, or coloring.",
  "frontend/src/pages/QuizZone.tsx": "React quiz page that loads backend or fallback questions, supports language-aware selection/history, tracks progress, and handles UI flow and scoring.",
  "frontend/src/services/audio.ts": "Audio service managing SFX and background music with Android WebView bridges, mute states, validation, and web fallbacks.",
  "frontend/src/types/androidBridge.d.ts": "Type definitions for Android WebView audio bridges enabling background music and sound effects playback.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, themes, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project state describing multilingual issues, required fixes, and pending feature requests for global language updates across the app."
}