{
  "backend/main.mo": "Defines data types for games, questions, media, and localization plus helper functions to convert backend objects into language-specific simplified forms, storing all content in in-memory maps.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and functionality of key frontend files across the project.",
  "frontend/index.css": "Defines global CSS variables and Tailwind layers for light and dark themes using OKLCH color values.",
  "frontend/index.html": "Main HTML entry with audio bridge detection script, root mount point, and service worker registration.",
  "frontend/public/sw.js": "Service worker implementing app‑shell caching, stale‑while‑revalidate asset strategy, and navigation fallback for offline use.",
  "frontend/README.md": "Frontend overview document describing features, offline support, and the audio system including Android WebView bridge requirements.",
  "frontend/src/App.tsx": "Root React component wiring providers, page navigation, age selection, and background music control.",
  "frontend/src/components/BackgroundMusicSelectorModal.tsx": "Empty file placeholder for a modal component to select background music tracks.",
  "frontend/src/components/CelebrationModal.tsx": "Modal that displays confetti, trophy graphic, encouragement text, and optional quiz results when a level is completed.",
  "frontend/src/components/coloring/ColoringCanvas.tsx": "Interactive coloring canvas supporting drawing, undo history, zooming, gestures, and template loading.",
  "frontend/src/components/Footer.tsx": "Footer with decorative icons and a link to the privacy policy, using translations for text.",
  "frontend/src/components/games/LogicPuzzleGame.tsx": "Logic puzzle game that generates age‑appropriate number puzzles, tracks progress, and reports completion.",
  "frontend/src/components/games/MathPuzzleGame.tsx": "Generates age-specific math problems and tracks score through a fixed number of questions. Supports restart triggers and provides multiple choice answers with toast feedback.",
  "frontend/src/components/games/MemoryCardGame.tsx": "Implements a memory matching game with many emoji themes and age‑based card sets. Manages flipping, matching, scoring, and completion callbacks.",
  "frontend/src/components/games/ProblemSolvingGame.tsx": "Presents scenario-based problem‑solving questions from backend or fallback data and tracks progress across categories. Handles answer checking, scoring, and category switching.",
  "frontend/src/components/games/QuickReactionTapGame.tsx": "Runs a timed reaction game where players tap the correct emoji target among distractors. Difficulty scales by age group and the game tracks rounds, score, and restart triggers.",
  "frontend/src/components/games/ShapeMatchingGame.tsx": "Creates shape‑matching puzzles using configurable rules per age level, generating paired shapes with varying attributes. Tracks matches, moves, levels, and completion.",
  "frontend/src/components/games/SortingClassificationGame.tsx": "Interactive sorting game that shuffles items, tracks remaining items, validates category selections, and triggers completion when all are sorted.",
  "frontend/src/components/games/VisualRecognitionGame.tsx": "Find‑the‑differences game that generates random difference points, tracks found spots, switches scenes, and completes when all differences are discovered.",
  "frontend/src/components/Header.tsx": "Header with app branding, language selector, music controls, and a button to return home.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown language selector allowing users to switch app language with flags and names.",
  "frontend/src/components/MusicControlsPopup.tsx": "Popover for selecting background music, toggling music and sound effects, and choosing tracks.",
  "frontend/src/config/audioConfig.ts": "Configures Android‑only audio mode detection and exposes a helper to check whether WebView bridge audio should be used exclusively.",
  "frontend/src/contexts/AudioSettingsContext.tsx": "Provides global state for background music and SFX mute settings, syncing values with localStorage and the audio service.",
  "frontend/src/contexts/BackgroundMusicContext.tsx": "Manages selected background music track with persistence and exposes setters via React context.",
  "frontend/src/contexts/LanguageContext.tsx": "Stores the app's current language, persists it, maps it to backend language enums, and provides context accessors.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on authentication identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAppBackgroundMusic.ts": "Controls background music playback with Android-WebView awareness, user-interaction gating, and prevention of redundant restarts.",
  "frontend/src/hooks/useBackgroundAudio.ts": "Starts background audio only after user interaction and avoids restarting the same track on re-renders with cleanup on unmount.",
  "frontend/src/hooks/useImageCache.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity React context and provider for managing authentication, identity loading, and login state using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines data‑fetching hooks using react-query to load games, questions, encouragement messages, and other content from a backend actor based on age group and language.",
  "frontend/src/hooks/useRandomizedQuizQuestions.ts": "React-query hook that fetches randomized quiz questions from the backend for a given age group and count.",
  "frontend/src/index.css": "Tailwind CSS setup defining a colorful child-friendly theme, base styles, and custom animations.",
  "frontend/src/lib/backgroundMusicOptions.ts": "Exports a list of background music options with IDs and labels.",
  "frontend/src/lib/coloringFallbackTemplates.ts": "Provides offline fallback coloring templates mapped by age group, each with strict outline-only requirements.",
  "frontend/src/lib/dailySurprise.ts": "Generates and stores a deterministic daily surprise game per age group using localStorage and seeded selection.",
  "frontend/src/lib/fallbackQuizQuestions.ts": "Contains large fallback pools of quiz questions in multiple languages organized by age group.",
  "frontend/src/lib/imageCache.ts": "Empty placeholder module for image caching functionality.",
  "frontend/src/lib/localizedText.ts": "Resolves a backend LocalizedText object into a string for a given UI language with English fallback.",
  "frontend/src/lib/logicPuzzleFallback.ts": "Provides fallback time-based logic puzzles in Turkish and English by age group with randomized selection and difficulty levels.",
  "frontend/src/lib/problemSolvingFallback.ts": "Defines age‑grouped fallback problem‑solving scenarios in Turkish, grouped by categories with options and correct answers.",
  "frontend/src/lib/quizQuestionSelection.ts": "Implements quiz question randomization with history tracking to reduce repeats and manage session-sized selections.",
  "frontend/src/lib/shapeMatchingRoundConfig.ts": "Generates shape‑matching round configs based on age and level, adjusting pair counts, shape sets, and rule features.",
  "frontend/src/lib/shapeMatchingRules.ts": "Defines matching rules for shapes with evaluation logic and filters rules by minimum age group.",
  "frontend/src/lib/sortingClassificationItemPools.ts": "Provides age‑based item pools and categories for a sorting/classification game using fruits, vegetables, animals, vehicles, and objects.",
  "frontend/src/lib/sortingClassificationSelection.ts": "Utility functions to select randomized, non-repeating sorting/classification items per age group, with validation and localStorage tracking.",
  "frontend/src/lib/sounds.ts": "Defines canonical sound ID lists and type-safe validators for SFX and background audio resources.",
  "frontend/src/lib/translations.ts": "Contains the shared translation dictionary and language type definitions for UI strings across multiple languages.",
  "frontend/src/main.tsx": "App entry that initializes React, React Query, Internet Identity provider, and renders the root component.",
  "frontend/src/pages/ColoringZone.tsx": "Coloring zone page that loads templates (backend or fallback), handles image errors, and displays or edits a selected coloring template.",
  "frontend/src/pages/GameZone.tsx": "Game zone page that loads available games, manages selected game state, and handles celebration flow after level completion.",
  "frontend/src/pages/HomePage.tsx": "Home page showing welcome text, age selection, and navigation to games, quizzes, or coloring sections.",
  "frontend/src/pages/QuizZone.tsx": "Quiz game page that loads backend or fallback questions, tracks quiz state, handles answers, scoring, language, and sound effects.",
  "frontend/src/services/audio.ts": "Audio service handling SFX and background music with Android WebView bridges and web fallbacks, including mute and validation logic.",
  "frontend/src/types/androidBridge.d.ts": "Type definitions for Android WebView audio bridges for background music and sound effects.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration including theme extensions, plugins, colors, animations, and container settings.",
  "project_state.json": "Project metadata describing current language-switching issues, requirements, and architectural notes."
}