{
  "backend/main.mo": "Defines data types for games, quizzes, sounds, and coloring templates, and includes logic for localization and converting complex data into simplified forms.",
  "feature_evidence.json": "Lists feature evidence reports mapping implemented features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files describing UI pages, components, hooks, and configuration.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color variables and theme layers for light and dark modes.",
  "frontend/index.html": "Main HTML entry enabling Android WebView audio detection and registering the Service Worker for offline support.",
  "frontend/public/sw.js": "Service Worker implementing offline caching with precache, stale-while-revalidate assets, and navigation fallback.",
  "frontend/README.md": "Documentation describing app features, offline support, sound system usage, and Android WebView/bridge-only audio behavior.",
  "frontend/src/App.tsx": "Sets up global providers and manages navigation between home, games, quiz, and coloring pages with age selection and background music.",
  "frontend/src/components/BackgroundMusicSelectorModal.tsx": "Provides a modal for selecting background music using radio options tied to the music context.",
  "frontend/src/components/CelebrationModal.tsx": "Displays a celebration dialog with confetti, messages, and optional quiz results, triggering sound and animations on open.",
  "frontend/src/components/coloring/ColoringCanvas.tsx": "Canvas-based coloring tool supporting drawing, undo, clearing, zoom gestures, and template image loading.",
  "frontend/src/components/Footer.tsx": "Renders a decorative footer with animated star and sparkles icons.",
  "frontend/src/components/games/LogicPuzzleGame.tsx": "Generates and presents age-appropriate logic puzzles, tracks progress, validates answers, and signals completion.",
  "frontend/src/components/games/MathPuzzleGame.tsx": "Generates age-based math problems with multiple-choice answers and tracks score and progress through a set number of questions.",
  "frontend/src/components/games/MemoryCardGame.tsx": "Implements a themed memory matching game with many emoji sets, handling flipping, matching, scoring, and completion logic.",
  "frontend/src/components/games/ProblemSolvingGame.tsx": "Presents age‑appropriate problem‑solving scenarios with selectable options, scoring correct answers across multiple categories.",
  "frontend/src/components/games/QuickReactionTapGame.tsx": "Runs a timed reaction game where players tap the correct target among distractors, progressing through multiple rounds based on age group settings.",
  "frontend/src/components/games/ShapeMatchingGame.tsx": "Builds configurable shape‑matching rounds using rules and generated shape pairs, tracking matches, moves, and level progression.",
  "frontend/src/components/games/SortingClassificationGame.tsx": "Implements a sorting game where children assign items to categories, tracking selections, correctness, and game completion.",
  "frontend/src/components/games/VisualRecognitionGame.tsx": "Provides a visual recognition find-the-differences game with randomized difference points, scene switching, and completion logic.",
  "frontend/src/components/Header.tsx": "Shows the app header with mascot, title, language selector, music selector, and a home button.",
  "frontend/src/components/LanguageSelector.tsx": "Dropdown menu for switching the app's language using the language context.",
  "frontend/src/config/audioConfig.ts": "Defines logic to detect and enable Android WebView–only audio mode via runtime config or environment variables.",
  "frontend/src/contexts/BackgroundMusicContext.tsx": "Context for selecting and persisting background music tracks using localStorage and providing track state to the app.",
  "frontend/src/contexts/LanguageContext.tsx": "Manages current language selection with validation, persistence, and mapping to backend language enums.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAppBackgroundMusic.ts": "Handles background audio playback with Android bridge support and user-interaction gating while preventing duplicate playback.",
  "frontend/src/hooks/useBackgroundAudio.ts": "Plays background audio after user interaction, ensuring no autoplay violations and avoiding unnecessary restarts.",
  "frontend/src/hooks/useImageCache.ts": "This file is currently empty or contains no implemented logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and persisted identity handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks that fetch games, questions, messages, and puzzles from the backend based on age group and language.",
  "frontend/src/hooks/useRandomizedQuizQuestions.ts": "Provides a React Query hook to fetch randomized quiz questions from the backend using age group, language, and count.",
  "frontend/src/index.css": "Tailwind-based global styles defining a colorful children-friendly theme and utility animations.",
  "frontend/src/lib/backgroundMusicOptions.ts": "Exports a list of selectable background music options with IDs and labels.",
  "frontend/src/lib/coloringFallbackTemplates.ts": "Defines offline fallback coloring templates per age group with strict outline-only image requirements.",
  "frontend/src/lib/dailySurprise.ts": "Implements daily surprise game selection per age group with deterministic randomization and localStorage persistence.",
  "frontend/src/lib/fallbackQuizQuestions.ts": "Provides a large fallback pool of quiz questions in multiple languages organized by age group.",
  "frontend/src/lib/imageCache.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/lib/quizQuestionSelection.ts": "Provides quiz question selection with shuffling, history tracking, and repeat reduction using localStorage.",
  "frontend/src/lib/shapeMatchingRoundConfig.ts": "Generates shape‑matching round settings based on age group and level, defining pair counts, shape types, and rule options.",
  "frontend/src/lib/shapeMatchingRules.ts": "Defines matching rules for shapes with evaluators and age restrictions, and filters rules by age group.",
  "frontend/src/lib/sortingClassificationItemPools.ts": "Contains item pools and category sets for sorting/classification, organized by age group with expanded items.",
  "frontend/src/lib/sortingClassificationSelection.ts": "Selects session items with shuffling, repetition avoidance, validation, and localStorage‑based history.",
  "frontend/src/lib/sounds.ts": "Lists valid sound effect and background IDs and provides type‑safe validators for sound IDs.",
  "frontend/src/lib/translations.ts": "Defines translation strings and supported language codes for the app’s UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/ColoringZone.tsx": "Displays a template grid for coloring, loads backend or fallback templates, handles image failures, and opens a coloring canvas when a template is selected.",
  "frontend/src/pages/GameZone.tsx": "Loads age‑appropriate games, shows a list, and launches the selected game with celebration handling upon completion.",
  "frontend/src/pages/HomePage.tsx": "Renders the welcome screen, handles age selection, and provides navigation to games, quizzes, or coloring.",
  "frontend/src/pages/QuizZone.tsx": "Runs a quiz session using backend or fallback questions, tracks progress and score, and shows results with celebration logic.",
  "frontend/src/services/audio.ts": "Provides sound playback via Android bridge or web audio, including effects and looping background audio with validation and fallback handling.",
  "frontend/src/types/androidBridge.d.ts": "Declares TypeScript definitions for the Android WebView audio bridge exposed on the global window object.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project’s state, including offline and audio reliability requirements, existing features, new requests, and Android WebView integration notes."
}