{
  "kind": "build_request",
  "title": "Add offline-capable app shell caching and harden Android WebView audio-only configuration",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add offline support for the React app by implementing a Service Worker that precaches the application shell and key static assets, so that the app can load and navigate when the device is offline (at minimum: load the Home page and previously cached routes without a blank screen).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "bu kodu çevrimdışı çalışma ... şekilde son final halini bana metin olarak gönder"
        ]
      },
      "acceptanceCriteria": [
        "A service worker file exists under the frontend’s static/public output (e.g., served from the site origin) and implements precache + runtime caching.",
        "When the app is opened once online and then the device is set offline, reloading the app does not show a blank page (the app shell renders).",
        "Caching strategy does not break normal online behavior (fresh loads still work and updates can be fetched)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Register the Service Worker from a non-immutable entry point (do not modify frontend/src/main.tsx) so the Service Worker is installed/activated in production builds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "çevrimdışı çalışma ..."
        ]
      },
      "acceptanceCriteria": [
        "Service worker registration is added via an allowed file (e.g., frontend/index.html) without changing any immutable paths.",
        "In production build, the browser devtools show the service worker is registered and controlling the page after reload."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure Android WebView “bridge-only audio” mode can be enabled automatically at runtime when running inside an Android WebView with the JS bridge available, so the app does not attempt web-audio fallback that can cause missing-file or user-gesture playback issues.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "ses sorunu yaşanmayacak şekilde"
        ]
      },
      "acceptanceCriteria": [
        "When window.Android is present, window.__AUDIO_CONFIG__.androidOnly is set to true early enough that the audio service respects Android-only mode (no HTMLAudioElement web fallback attempts when bridge methods are missing).",
        "On normal browsers (no window.Android), existing web-audio behavior remains unchanged."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update documentation to include a final, copy/paste-ready Android Kotlin MainActivity example that configures WebView for offline-friendly caching and reliable audio playback, and that loads https://learnfun-h93.caffeine.xyz/ while exposing the AndroidAudio and BackgroundAudio JS interfaces.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "... son final halini bana metin olarak gönder"
        ]
      },
      "acceptanceCriteria": [
        "frontend/README.md includes an English Kotlin code block for MainActivity that (1) enables JavaScript + DOM storage, (2) sets mediaPlaybackRequiresUserGesture=false, (3) configures cache mode for offline-friendly behavior, (4) adds the AndroidAudio and BackgroundAudio JS interfaces, and (5) loads https://learnfun-h93.caffeine.xyz/.",
        "The snippet is self-contained and consistent with the app’s documented audio bridge expectations (res/raw naming, bridge methods)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/main.tsx or any other paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Backend must remain single-actor; do not introduce additional backend canisters/services.",
    "Do not add third-party auth or external databases/services."
  ],
  "nonGoals": [
    "Implementing the native Android Studio project (Gradle/Manifest/XML) directly in this codebase.",
    "Adding new gameplay features or changing existing game logic.",
    "Adding real-time communication features (WebSockets/chat)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}