{
  "kind": "build_request",
  "title": "Fix audio mute toggles so Off fully silences the app",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the Background Music mute toggle fully stops any currently playing background music when switched to Off (including Android WebView bridge mode and the web fallback).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Ses açma kapama tuşları birşeye yaramıyor. Kapalı konuma getirince sesin tamamen kapanması lazım"
        ]
      },
      "acceptanceCriteria": [
        "When Background Music is toggled Off while a track is playing, the background music stops immediately (no lingering audio)",
        "When Background Music is toggled Off and the user navigates between pages, background music does not resume until toggled On",
        "In non-Android (web fallback) mode, the HTMLAudioElement background track is paused and reset to time 0 when toggled Off",
        "In Android WebView bridge mode, the app attempts to stop background music via the bridge if a stop/pause method is available; if no stop method exists, the implementation must still prevent any further background playback attempts while muted"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make the global mute state changes take effect immediately and reliably by updating the audio service so that setting background-music mute to true triggers the stop behavior without relying on a subsequent start call.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Kapalı konuma getirince sesin tamamen kapanması lazım"
        ]
      },
      "acceptanceCriteria": [
        "Toggling Background Music Off causes stop behavior even if no new track start is initiated afterwards",
        "Toggling Background Music On allows playback again using the currently selected track (after user interaction gating on web, as currently designed)"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the Sound Effects (SFX) mute toggle fully mutes SFX by preventing any new sound effects from playing while Off across the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Ses açma kapama tuşları birşeye yaramıyor."
        ]
      },
      "acceptanceCriteria": [
        "When SFX is toggled Off, calls to the SFX playback function result in no sound output",
        "When SFX is toggled On again, SFX playback works normally"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep the backend architecture unchanged (single Motoko actor); no backend changes are required for this fix."
  ],
  "nonGoals": [
    "Adding a new master mute toggle (unless explicitly requested later).",
    "Changing the Android wrapper app / native bridge implementation (only handle what is possible from the web layer).",
    "Adding new audio tracks or changing the existing music selection UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}