{
  "kind": "build_request",
  "title": "Fix app-wide instant language switching for all languages (Game/Quiz/Coloring included)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure that selecting any supported language (tr, en, es, fr, de, it, ru, pt, zh, ja) updates all visible UI text immediately across the entire app, including Game Zone, Quiz Zone, and Coloring Zone, without requiring navigation or page refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-5",
          "recent-6"
        ],
        "quotes": [
          "türkçe ve ingilizce çalışıyor ama diğer diller çalışmıyor.",
          "tüm dillere hangi dil seçilirse anında tüm uygulama o dil seçeneğine dönecek"
        ]
      },
      "acceptanceCriteria": [
        "When the user changes the language from the header, the currently-open screen (including Game Zone, Quiz Zone, and Coloring Zone) re-renders and shows the newly-selected language immediately.",
        "No section remains stuck in English when a non-English language is selected.",
        "Language choice persists via existing localStorage behavior and is applied on reload."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Audit Game Zone, Quiz Zone, and Coloring Zone pages and all game/coloring components they render, and remove/replace any hard-coded English strings with the existing translation system (useTranslation(language)) or localized fallback pools so that all user-facing strings can render in the selected language.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-3",
          "recent-5"
        ],
        "quotes": [
          "Hala oyun bölgesi-Quiz Bölgesi ve Boyama bölümü içindeki kısımlarda çeviri gerçekleşmiyor sadece ingilizce gözülüyor",
          "türkçe ve ingilizce çalışıyor ama diğer diller çalışmıyor."
        ]
      },
      "acceptanceCriteria": [
        "Switching language to es/fr/de/it/ru/pt/zh/ja changes Game Zone UI labels, in-game instructions, buttons, and headings (not only the main navigation labels).",
        "Switching language to es/fr/de/it/ru/pt/zh/ja changes Quiz Zone UI labels/messages (loading, score/question labels, buttons, toasts) and the fallback question pool selection uses the chosen language.",
        "Switching language to es/fr/de/it/ru/pt/zh/ja changes Coloring Zone UI labels (choose template, start coloring, unavailable states, etc.)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Complete or корректly map missing translation keys so that es/fr/de/it/ru/pt/zh/ja do not silently fall back to the English `commonTranslations` values for strings used in Game Zone, Quiz Zone, and Coloring Zone (including sub-features like Daily Surprise card labels and in-game category labels).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-5"
        ],
        "quotes": [
          "türkçe ve ingilizce çalışıyor ama diğer diller çalışmıyor."
        ]
      },
      "acceptanceCriteria": [
        "For each supported language (tr, en, es, fr, de, it, ru, pt, zh, ja), the UI strings used on Game Zone/Quiz Zone/Coloring Zone have explicit translations (not English defaults), except for proper nouns like the app name if intentionally unchanged.",
        "Language selector changes result in visibly different translations for at least the core labels on each of the three zones (e.g., Back, Loading, Choose Template, Start Coloring, Question, Score, etc.)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure backend-provided localized content does not cause unintended English-only display for non-English languages: for any backend endpoints used by Game Zone/Quiz Zone/Coloring Zone that return localized structures, verify the requested language is applied; where the backend has language-specific message pools, add missing languages or provide a non-English fallback strategy that matches the selected language.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-5",
          "recent-6"
        ],
        "quotes": [
          "türkçe ve ingilizce çalışıyor ama diğer diller çalışmıyor.",
          "tüm dillere hangi dil seçilirse anında tüm uygulama o dil seçeneğine dönecek"
        ]
      },
      "acceptanceCriteria": [
        "Backend endpoints that accept a `Language` parameter return content localized to that language when available, rather than always returning English.",
        "No backend feature used in the app-wide flow (e.g., encouragement messages) returns English-only text for languages that the app claims to support, unless the language is explicitly not supported by that feature and the fallback behavior is documented/consistent."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx (immutable paths).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if existing stable state must be upgraded."
  ],
  "nonGoals": [
    "Adding new languages beyond the currently supported set (tr, en, es, fr, de, it, ru, pt, zh, ja).",
    "Introducing third-party i18n libraries or external translation services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}