{
  "kind": "build_request",
  "title": "Fix Coloring Canvas pinch-zoom to zoom toward the touched area and allow reliable zoom-out",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Coloring Canvas touch gesture logic so that two-finger pinch zooms toward the pinch focal point (midpoint between fingers) and allows smooth, reliable zoom-out back to the full view. The zoom behavior must feel natural for a coloring app: users can zoom into the intended area and navigate the zoomed canvas without losing the target region.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Boyama alanında söyle bir sorun var iki parmakla dokunarak yaklaşıyor ama istenilen alana yakınlaşamıyor ya da uzaklaşılamıyor. buradaki sorunu boyama mantığına uygun olarak çmz"
        ]
      },
      "acceptanceCriteria": [
        "On touch devices, a two-finger pinch gesture zooms in/out centered around the pinch midpoint (the content under the midpoint stays under the midpoint as scale changes).",
        "Zoom-out via pinch works consistently and can return to the default full view (1x) without getting stuck.",
        "The user can reposition the zoomed canvas in a touch-friendly way (e.g., two-finger pan or equivalent) so they can reach any area after zooming in.",
        "Single-finger touch remains dedicated to drawing (no accidental pan/zoom while drawing).",
        "Existing zoom controls (buttons and double-tap zoom toggle) continue to work and do not conflict with pinch gestures."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Adjust the Coloring Canvas layout/interaction implementation (in the existing component) so touch handling does not rely on browser default page zoom/scroll in a way that prevents reaching the intended zoom target. Ensure touch-action / preventDefault usage is correct so pinch and pan affect the canvas transform rather than the page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "iki parmakla dokunarak yaklaşıyor ama istenilen alana yakınlaşamıyor ya da uzaklaşılamıyor"
        ]
      },
      "acceptanceCriteria": [
        "Pinch-zoom and pan manipulate only the coloring canvas viewport (not the browser page zoom).",
        "No jittering/fighting between container scrolling and gesture-based zoom/pan while interacting with the canvas.",
        "Zoom state remains stable across continuous pinch gestures (no sudden jumps in scale or position)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Keep all changes within the existing React + TypeScript + Tailwind codebase (no new frameworks)."
  ],
  "nonGoals": [
    "Do not add new backend APIs or change the Motoko canister.",
    "Do not add new coloring templates or image assets.",
    "Do not add user save/load features for drawings."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}