{
  "kind": "build_request",
  "title": "Fix language switching so all app content updates across pages and games",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the language-switch regression so that changing the language updates 100% of user-visible text across the entire app (not only the top header bar), without requiring a page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "dil seçeneğini değişince sadece üst kısımdaki var değişiyor diğer içerikler hep aynı kalıyor",
          "yüzde yüz bir değişme olsun",
          "build"
        ]
      },
      "acceptanceCriteria": [
        "When the user changes language via the language selector, all visible text on the currently open page updates immediately (same render cycle) to the selected language.",
        "This includes at minimum: HomePage, GameZone, QuizZone, ColoringZone, Header, Footer, and any open modals/dialogs (e.g., CelebrationModal).",
        "No full page reload is needed; the UI updates purely via React state/context changes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove/replace hardcoded non-localized strings in pages and components so they are sourced from the translation system (LanguageContext + translations) or from language-aware backend data, ensuring all in-game/generated texts also switch language correctly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "sadece üst baardaki kısımlar değişiyor",
          "yüzde yüz bir değişme olsun"
        ]
      },
      "acceptanceCriteria": [
        "All previously hardcoded UI strings in pages/components are replaced with translated strings (via the existing translation approach used in other components).",
        "ProblemSolvingGame must not generate Turkish-only scenario/option text; generated/fallback scenarios/options must be language-aware so switching between Turkish and English changes the displayed scenarios/options accordingly.",
        "Any accessibility/screen-reader-only user-facing strings (e.g., dialog descriptions) are also localized or derived from existing translations so they reflect the selected language."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure React Query data that is language-dependent is refetched (or recomputed) on language change so backend-sourced localized content updates consistently across the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "dil seçeneğini değişince ... diğer içerikler hep aynı kalıyor"
        ]
      },
      "acceptanceCriteria": [
        "Backend-sourced localized content (e.g., games list text, quiz questions, encouragement messages) updates when language changes.",
        "React Query query keys for language-dependent queries include the current backend language value, and any derived local state from those queries is refreshed on language change (no stale language text remains)."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text in this build request.",
    "Do not edit files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new languages beyond the existing supported set.",
    "Redesigning UI layout or adding new features unrelated to language switching."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}