{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix app-wide language switching across pages, games, and React Query content",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure changing the selected language updates all user-visible text across the entire app immediately, without reloads.",
      "acceptanceCriteria": [
        "When the user changes language via the language selector, all visible text on the currently open page updates immediately (same render cycle) to the selected language.",
        "This includes at minimum: HomePage, GameZone, QuizZone, ColoringZone, Header, Footer, and any open modals/dialogs (e.g., CelebrationModal).",
        "No full page reload is needed; the UI updates purely via React state/context changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/LanguageContext.tsx",
          "operation": "modify",
          "description": "Expose a stable, reactive backend language value (derived from the selected UI language) from LanguageContext so that components and React Query hooks can reliably re-render/refetch on language changes."
        },
        {
          "path": "frontend/src/components/CelebrationModal.tsx",
          "operation": "modify",
          "description": "Remove hardcoded dialog screen-reader description strings and derive them from translations so an open CelebrationModal updates its visible and sr-only text immediately when language changes."
        },
        {
          "path": "frontend/src/components/games/ProblemSolvingGame.tsx",
          "operation": "modify",
          "description": "Ensure current problem scenario/options are recomputed or regenerated when language changes (including when showing backend-sourced LocalizedText) so the currently open game view updates without a reload."
        },
        {
          "path": "frontend/src/components/games/LogicPuzzleGame.tsx",
          "operation": "modify",
          "description": "Ensure language-dependent puzzle text (fallback puzzles and backend LocalizedText-derived content) updates immediately when language changes by including language in relevant computations/effects."
        },
        {
          "path": "frontend/src/components/games/VisualRecognitionGame.tsx",
          "operation": "modify",
          "description": "Replace the hardcoded instruction sentence and any other user-facing text fragments with translations and ensure the rendered instruction updates immediately on language change."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace hardcoded non-localized UI strings with the translation system and make generated/fallback in-game text language-aware (especially ProblemSolvingGame).",
      "acceptanceCriteria": [
        "All previously hardcoded UI strings in pages/components are replaced with translated strings (via the existing translation approach used in other components).",
        "ProblemSolvingGame must not generate Turkish-only scenario/option text; generated/fallback scenarios/options must be language-aware so switching between Turkish and English changes the displayed scenarios/options accordingly.",
        "Any accessibility/screen-reader-only user-facing strings (e.g., dialog descriptions) are also localized or derived from existing translations so they reflect the selected language."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/translations.ts",
          "operation": "modify",
          "description": "Add missing translation keys for any newly-localized strings uncovered during the sweep (e.g., modal sr-only descriptions, image alt text labels, and game-specific instruction strings)."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded image alt text (e.g., the mascot image) with translated strings from the existing translation system."
        },
        {
          "path": "frontend/src/pages/ColoringZone.tsx",
          "operation": "modify",
          "description": "Replace hardcoded template image alt text with translated strings (or a translated pattern-based label) so it reflects the selected language."
        },
        {
          "path": "frontend/src/components/games/MathPuzzleGame.tsx",
          "operation": "modify",
          "description": "Replace hardcoded image alt text with translated strings so it updates on language change."
        },
        {
          "path": "frontend/src/components/games/VisualRecognitionGame.tsx",
          "operation": "modify",
          "description": "Replace hardcoded image alt text and the Turkish-only instruction line with translated strings."
        },
        {
          "path": "frontend/src/components/games/ProblemSolvingGame.tsx",
          "operation": "modify",
          "description": "Replace Turkish-only fallback scenarios/options with a language-aware fallback pool (at minimum Turkish and English) sourced from translations or from a language-aware fallback generator."
        },
        {
          "path": "frontend/src/components/games/LogicPuzzleGame.tsx",
          "operation": "modify",
          "description": "Replace Turkish-only fallback puzzle text (notably time/spatial puzzles and any remaining Turkish strings) with language-aware versions (at minimum Turkish and English) and ensure selection uses the active language."
        },
        {
          "path": "frontend/src/lib/problemSolvingFallback.ts",
          "operation": "create",
          "description": "Create a centralized, language-aware fallback problem generator for ProblemSolvingGame that provides scenario/options/correctOption in at least Turkish and English, and falls back to English for other supported languages."
        },
        {
          "path": "frontend/src/lib/logicPuzzleFallback.ts",
          "operation": "create",
          "description": "Create a centralized, language-aware fallback puzzle generator for LogicPuzzleGame for any puzzle types that currently contain hardcoded Turkish strings, with at least Turkish and English variants and English fallback."
        },
        {
          "path": "frontend/src/lib/localizedText.ts",
          "operation": "create",
          "description": "Add a shared helper to resolve backend LocalizedText into the current UI language (with an English fallback) to avoid duplicating mapping logic and to ensure consistent language switching behavior across games."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Refetch/recompute language-dependent React Query data on language change by including backend language in query keys and refreshing derived local state.",
      "acceptanceCriteria": [
        "Backend-sourced localized content (e.g., games list text, quiz questions, encouragement messages) updates when language changes.",
        "React Query query keys for language-dependent queries include the current backend language value, and any derived local state from those queries is refreshed on language change (no stale language text remains)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update language-dependent React Query query keys to include the current backend language value and ensure queries that return or contain localized content refresh when the language changes."
        },
        {
          "path": "frontend/src/hooks/useRandomizedQuizQuestions.ts",
          "operation": "modify",
          "description": "Ensure the randomized quiz questions query key and query function are explicitly tied to the current backend language value so changing language triggers a refetch and avoids stale localized questions."
        },
        {
          "path": "frontend/src/pages/GameZone.tsx",
          "operation": "modify",
          "description": "Ensure any local derived state from language-dependent queries (e.g., displayed game name/description derived from backend data) is not cached in a way that prevents immediate updates when language changes."
        },
        {
          "path": "frontend/src/pages/QuizZone.tsx",
          "operation": "modify",
          "description": "Ensure derived local state from backend quiz queries is re-initialized as needed on language changes so no stale-language question text remains in the active quiz session."
        }
      ]
    }
  ]
}