{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix audio mute toggles to fully silence background music and SFX",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Background Music toggle Off immediately stop any currently playing background music (Android bridge mode and web fallback) and prevent resuming while muted.",
      "acceptanceCriteria": [
        "When Background Music is toggled Off while a track is playing, the background music stops immediately (no lingering audio)",
        "When Background Music is toggled Off and the user navigates between pages, background music does not resume until toggled On",
        "In non-Android (web fallback) mode, the HTMLAudioElement background track is paused and reset to time 0 when toggled Off",
        "In Android WebView bridge mode, the app attempts to stop background music via the bridge if a stop/pause method is available; if no stop method exists, the implementation must still prevent any further background playback attempts while muted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAppBackgroundMusic.ts",
          "operation": "modify",
          "description": "Ensure that when the provided soundId becomes null (e.g., background music toggled Off), the hook explicitly stops background playback immediately and resets internal tracking refs so music does not resume across navigation while muted."
        },
        {
          "path": "frontend/src/services/audio.ts",
          "operation": "modify",
          "description": "Update background stop behavior to fully stop/reset web fallback playback (pause + set currentTime=0) and, in Android WebView bridge mode, attempt to stop/pause via any available bridge method while still clearing internal currentBackgroundId to prevent further playback attempts when muted."
        },
        {
          "path": "frontend/src/types/androidBridge.d.ts",
          "operation": "modify",
          "description": "Extend BackgroundAudioBridge typings to optionally include stop/pause-like methods (as optional function properties) so the web layer can safely attempt to stop background playback when available without assuming the method exists."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make background-music mute state changes trigger stop behavior immediately by updating the audio service and where mute state is synchronized.",
      "acceptanceCriteria": [
        "Toggling Background Music Off causes stop behavior even if no new track start is initiated afterwards",
        "Toggling Background Music On allows playback again using the currently selected track (after user interaction gating on web, as currently designed)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/services/audio.ts",
          "operation": "modify",
          "description": "Change setBgMusicMuted(true) to immediately trigger the same stop behavior as an explicit stop call (including clearing currentBackgroundId and stopping any active web fallback audio), so muting does not rely on a subsequent start call."
        },
        {
          "path": "frontend/src/contexts/AudioSettingsContext.tsx",
          "operation": "modify",
          "description": "Synchronize isBgMusicMuted changes to the audio service from within the provider (instead of relying on a specific UI component lifecycle), ensuring mute changes take effect immediately and reliably across the app."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Remove or simplify local mute-to-audio-service synchronization effects if they become redundant after moving the synchronization to AudioSettingsProvider, keeping the Header focused on UI toggles only."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure SFX mute toggle fully mutes sound effects by reliably preventing new SFX playback while Off across the app.",
      "acceptanceCriteria": [
        "When SFX is toggled Off, calls to the SFX playback function result in no sound output",
        "When SFX is toggled On again, SFX playback works normally"
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/AudioSettingsContext.tsx",
          "operation": "modify",
          "description": "Synchronize isSfxMuted changes to the audio service from within the provider so the global SFX mute flag is always up-to-date before any SFX playback calls occur."
        },
        {
          "path": "frontend/src/services/audio.ts",
          "operation": "modify",
          "description": "Confirm playSound respects the global SFX mute flag consistently across Android bridge mode and web fallback (early return when muted), and keep behavior stable when toggling back On."
        }
      ]
    }
  ]
}