{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Uygulamanın dil seçimi değiştiğinde tüm UI metinlerinin seçilen dile dönüştüğü, çok dilli (i18n) tam çeviri paketleriyle çalışan bir dil sistemi hedefleniyor. İlk adım olarak tek tek dil çeviri dosyaları (başlangıç: İspanyolca) oluşturulacak.",
  "architectural_notes": [
    "Çeviri sistemi şu an eksik dillerde İngilizceye fallback yapıyor; hedef her dil için ayrı çeviri dosyaları ve dil değişiminde anında tüm UI metinlerinin güncellenmesi."
  ],
  "known_issues": [
    "Dil sekmesi: Türkçe/İngilizce dışındaki diller seçilince içerik İngilizceye dönüyor (eksik çeviri dosyaları nedeniyle fallback).",
    "Kapsamlı çok-dilli çeviri dosyası üretim istekleri derleme/uygulama adımında hata veriyor (istek tek seferde çok büyük)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-create-a-complete-spanish-es-translation-pack-for-the-ui-by-replacing-the-current-es-commontranslations-fallback-with-an-explicit-spanish-dictionary-in-frontend-src-lib-translations-ts-i-e-provide-spanish-values-for-all-keys-currently-present-in-commontranslations-preserving-any-emojis-icons-where-they-exist-do-not-change-other-languages-in-this-step",
      "title": "Create a complete Spanish (es) translation pack for the UI by replacing the current `es: commonTranslations` fallback with an explicit Spanish dictionary in `frontend/src/lib/translations.ts` (i.e., provide Spanish values for all keys currently present in `commonTranslations`, preserving any emojis/icons where they exist). Do not change other languages in this step.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Dil değiştiğinde tüm UI'nin seçilen dile dönmesi için çok dilli (i18n) tam çeviri desteği ekle (tr, en, de, fr, zh, pt, es, it, hi, ru).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "İspanyolca (es) için çeviri dosyasını/pack'ini oluştur (diğer dillere geçmeden önce ilk adım).",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "projectName": "Create Spanish (es) UI translation pack",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}